/**
 * @author foolchid
 * @date 2024/5/21
 **/
public class InterviewAll {



69. 如何应对暴力调用 Open API
78. 服务请求激增，怎么处理
81. 搜索引擎的删除过程

92. 再加一个堆插入结点的步骤
93. jdk原生工具，jmx（MBean），线程池各个参数
94. javaagent接入流程

数据结构&算法
1. 一个是 区间融合 另一个最大岛

3. lru 算法 lru 多线程算法有一个数字矩阵，包含0和1，相邻的数字1代表“陆地”;给出某个坐标，求该坐标对应的陆地面积 (即有多少个相邻的 1)?在矩阵很大的情况下，有没有更快的办法?
4. gfp gsp 区别 问题

14. 安排会议室，有一个包含开始时间和结束时间(0~24，精确到 0.5)的二维数组，确定需要 的最少会议室，时间复杂度是多少
15. 输入一个 List<List<Integer>>，每个 List 的前一个元素依赖后一个元素(想象成一个分布式系统，必须我所依赖的项目都启动了，我才能启动)，如何确定最优的启动顺序
17. 合并多个有序队列，lru 算法 io 模型
18. 数据项为<学生 ID，分数>，用什么数据结构来存储可以实现同时满足:1.由学生 ID 查询分数，2.查询某一 分数段上的学生 ID?
19. 用户登录日志，数据项为<用户 ID，时间，登入/登出>，统计出用户数最多的时段以及最多的用户数。
20. 涉及到 mysql，mongo，kafka，hbase，redis，memcached 相关的知识

24. 红黑树的数据结构
25. 复杂链表的复制
26. 比如十几亿个数据里找到较小的 100 个数。

27. MySQL，互斥锁，乐观锁
27. 定时器实现 聊天已读状态标记 三个杯子倒水
28. int integer 区别
29. 最后一题常规股票买卖
30. 牛客的跳石板、单例模式、合并区间、找出出现超过一半的数
31. topK 算法 汉字数字转汉字
32. 手写一致性 hash 算法的应用场景，请求进来怎么通过一致性哈希算法 找到实际的机器 IP 的代码实现 过程
33. kafka 为什么 topic 多了，性能会下降?怎么设计才能使保证消息只投递过一次，不是能使用业务上的
41. 三数之和（注意交流，面试官很nice,会给提示）


}
